export const cards1 = [
    {
        img: "/assets/cardImg1.png",
        background: "#FFC300",
        width: "670px"
    },
    {
        subTitle: "Почему получается так дешево?",
        width: "670px",
        text: 'Подписка на сервисы получается очень дешевой, потому что мы используем принцип "Складчины" или, как его еще называют, "Семейная подписка". Это когда на один аккаунт добавляется несколько человек. Стоит отметить, что в нашем ассортименте есть сервисы, где подписка выдается только на Ваш личный аккаунт и только Вы имеете к нему доступ. Также важно учесть, что для каждого сервиса существует определенное количество пользователей, которое удобно для использования. Всё зависит от лимитов, которые устанавливает сам сервис. Например, на аккаунт Midjourney мы добавляем не более 3-4 человек. Благодаря этому мы никогда не сталкиваемся с проблемой, когда кто-то не может сгенерировать картинку. Все работают в комфорте. Подробнее о каждом сервисе можно узнать у нашего администратора. Написать ему можно через Telegram. Ищите по нику <span className="">@НИКНИКНИКНИКНИК</span>'
    },
    {
        subTitle: "Почему у AbbsNet не бывает банов?",
        width: "670px",
        text: 'Обычно аккаунты на сервисах, подобных нашему, часто получают блокировки из-за того, что их ловит система безопасности. Это выглядит очень подозрительно, когда, например, пользователь сначала заходит на аккаунт из Варшавы с Виндовс ноутбука, а через 15 минут он уже в Москве, используя ноутбук с MacOS. А теперь представьте, что так могут одновременно зайти 5 пользователей и все с максимально разных локаций и используют разные устройства и операционные системы. Конечно, любой сервис ожидает, что каждый из этих 5 людей заплатит за доступ. Поэтому системы безопасности часто блокируют аккаунты у наших конкурентов. Исходя из этого, мы сделали то, что никто не делал раньше! Мы создали свой браузер, который автоматически настраивает все необходимые параметры для входа в аккаунт. По аналогичному принципу, как работают антидетект-браузеры.'
    },
    {
        title: <svg width="63" height="63" viewBox="0 0 63 63" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g clipPath="url(#clip0_1_99)">
                <path d="M56.1216 12.1201C55.4202 11.1233 54.5713 10.2005 53.6853 9.31465C52.7994 8.42883 51.8766 7.57956 50.8799 6.8782C45.3797 2.48555 38.6244 0 31.5 0C23.1204 0 15.2577 3.37148 9.31465 9.31465C3.37161 15.2578 0 23.1204 0 31.5C0 38.6613 2.48555 45.4165 6.87844 50.9168C7.61672 51.8763 8.42871 52.7992 9.31465 53.6853C10.2006 54.5713 11.1234 55.3833 12.0832 56.1216C17.5833 60.5145 24.3387 63 31.5 63C39.8796 63 47.7423 59.6285 53.6853 53.6853C59.6285 47.7421 63 39.8794 63 31.5C63 24.3756 60.5145 17.6203 56.1216 12.1201ZM7.50586 31.5C7.50586 25.077 10.016 19.06 14.5197 14.5194C19.06 10.016 25.077 7.50586 31.5 7.50586C36.6681 7.50586 41.5774 9.13008 45.6382 12.1201L12.157 45.638C9.13008 41.5774 7.50586 36.6678 7.50586 31.5ZM48.4803 48.4803C43.94 52.984 37.923 55.4941 31.5 55.4941C26.3319 55.4941 21.4226 53.8699 17.3618 50.843L50.8799 17.3619C53.8699 21.4223 55.4941 26.3319 55.4941 31.5C55.4941 37.923 52.984 43.94 48.4803 48.4803Z" fill="#FFFF00" />
                <path d="M12.0832 56.1216C17.5833 60.5145 24.3387 63 31.5 63C39.8796 63 47.7423 59.6286 53.6853 53.6854C59.6285 47.7421 63 39.8794 63 31.5C63 24.3756 60.5144 17.6204 56.1215 12.1202C55.4202 11.1234 54.5713 10.2005 53.6853 9.3147L9.31464 53.6854C10.2005 54.5713 11.1233 55.3833 12.0832 56.1216ZM50.8799 17.3618C53.8699 21.4224 55.4941 26.332 55.4941 31.5C55.4941 37.9231 52.984 43.9401 48.4803 48.4804C43.94 52.984 37.923 55.4942 31.5 55.4942C26.3319 55.4942 21.4226 53.87 17.3618 50.843L50.8799 17.3618Z" fill="#E9E900" />
            </g>
            <defs>
                <clipPath id="clip0_1_99">
                    <rect width="63" height="63" fill="white" />
                </clipPath>
            </defs>
        </svg>,
        textAlign: "center",
        width: "325px",
        text: "Максимально надежная защита от банов благодаря антидетект-системе, которая автоматически настраивает параметры для безопасного входа за Вас, предотвращая подозрительные смены устройств и местоположений.",
    },
    {
        textAlign: "center",
        title: "20+",
        width: "325px",
        text: "Сервисов и нейросетей уже добавлены в наш ассортимент, и мы без проблем предоставляем доступ. Все они обеспечивают высокое качество и надежность, а наша система защиты гарантирует бесперебойную работу без блокировок."
    }
]


export const cards2 = [
    {
        icon: <svg width="43" height="52" viewBox="0 0 43 52" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M21.2607 0C13.2714 8.39556 0 6.5 0 6.5C0 6.5 0 15.8438 0 29.25C0 42.6562 21.2607 52 21.2607 52C21.2607 52 42.5214 42.6562 42.5214 29.25C42.5214 15.8438 42.5214 6.5 42.5214 6.5C42.5214 6.5 29.25 8.39556 21.2607 0Z" fill="#FFFF00" />
            <g opacity="0.15">
                <path d="M21.2607 7.48364C15.5708 13.4628 6.12057 12.1125 6.12057 12.1125C6.12057 12.1125 6.12057 18.7668 6.12057 28.3137C6.12057 37.8606 21.2607 44.5158 21.2607 44.5158C21.2607 44.5158 36.4016 37.8614 36.4016 28.3145C36.4016 18.7676 36.4016 12.1133 36.4016 12.1133C36.4016 12.1133 26.9506 13.4628 21.2607 7.48364Z" fill="black" />
            </g>
            <path d="M19.7722 34.2847L11.9202 27.7237L14.0035 25.2294L19.149 29.5291L27.5787 17.5764L30.2348 19.4484L19.7722 34.2847Z" fill="#2D2929" />
        </svg>,
        title: 'Полноценный доступ',
        text: 'Полный доступ к сервисам и нейросетям — без ограничений, непонятных Telegram ботов и лишней мороки.'
    },
    {
        icon: <svg width="51" height="25" viewBox="0 0 51 25" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M50.4358 12.5C50.4358 5.60744 44.8284 0 37.9358 0C34.5969 0 31.4579 1.3002 29.097 3.66122L16.3789 16.3791C15.3429 17.4152 13.9653 17.9859 12.4999 17.9859C9.47494 17.9859 7.01402 15.525 7.01402 12.5C7.01402 9.47503 9.47494 7.01412 12.4999 7.01412C13.9653 7.01412 15.3429 7.58477 16.379 8.62097L18.1685 10.4104L23.1283 5.45071L21.3387 3.66122C18.9777 1.3002 15.8388 0 12.4999 0C5.60744 0 0 5.60744 0 12.5C0 19.3926 5.60744 25 12.5 25C15.8389 25 18.9778 23.6998 21.3388 21.3388L34.0569 8.62078C35.0929 7.58468 36.4705 7.01402 37.9359 7.01402C40.9609 7.01402 43.4218 9.47493 43.4218 12.4999C43.4218 15.5249 40.9609 17.9858 37.9359 17.9858C36.4704 17.9858 35.0928 17.4151 34.0568 16.3788L32.2673 14.5894L27.3075 19.5491L29.097 21.3386C31.458 23.6995 34.597 24.9998 37.9359 24.9998C44.8284 25 50.4358 19.3926 50.4358 12.5Z" fill="#FFFF00" />
        </svg>,
        title: 'Бесперебойная работа',
        text: 'Вы защищены от банов благодаря нашему браузеру. В случае блокировки — предоставим замену.',
    },
    {
        icon: <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M38.07 19.4652H25.8607C24.9072 19.4652 24.1165 18.6745 24.1165 17.721C24.1165 16.7675 24.9072 15.9768 25.8607 15.9768H38.07C39.0235 15.9768 39.8142 16.7675 39.8142 17.721C39.8142 18.6745 39.0467 19.4652 38.07 19.4652Z" fill="#FFFF00" />
            <path d="M13.6502 21.2325C13.2083 21.2325 12.7664 21.0697 12.4176 20.7209L10.6734 18.9766C9.999 18.3022 9.999 17.1859 10.6734 16.5115C11.3478 15.8371 12.4641 15.8371 13.1385 16.5115L13.6502 17.0231L17.6502 13.0231C18.3246 12.3487 19.4409 12.3487 20.1153 13.0231C20.7898 13.6976 20.7898 14.8138 20.1153 15.4883L14.8827 20.7209C14.5571 21.0465 14.1153 21.2325 13.6502 21.2325Z" fill="#FFFF00" />
            <path d="M38.07 35.7447H25.8607C24.9072 35.7447 24.1165 34.954 24.1165 34.0005C24.1165 33.047 24.9072 32.2563 25.8607 32.2563H38.07C39.0235 32.2563 39.8142 33.047 39.8142 34.0005C39.8142 34.954 39.0467 35.7447 38.07 35.7447Z" fill="#FFFF00" />
            <path d="M13.6502 37.5117C13.2083 37.5117 12.7664 37.349 12.4176 37.0001L10.6734 35.2559C9.999 34.5815 9.999 33.4652 10.6734 32.7908C11.3478 32.1164 12.4641 32.1164 13.1385 32.7908L13.6502 33.3024L17.6502 29.3024C18.3246 28.628 19.4409 28.628 20.1153 29.3024C20.7898 29.9769 20.7898 31.0931 20.1153 31.7676L14.8827 37.0001C14.5571 37.3257 14.1153 37.5117 13.6502 37.5117Z" fill="#FFFF00" />
            <path d="M31.9767 50H18.0233C5.39535 50 0 44.6046 0 31.9767V18.0233C0 5.39535 5.39535 0 18.0233 0H31.9767C44.6046 0 50 5.39535 50 18.0233V31.9767C50 44.6046 44.6046 50 31.9767 50ZM18.0233 3.48837C7.30232 3.48837 3.48837 7.30232 3.48837 18.0233V31.9767C3.48837 42.6977 7.30232 46.5116 18.0233 46.5116H31.9767C42.6977 46.5116 46.5116 42.6977 46.5116 31.9767V18.0233C46.5116 7.30232 42.6977 3.48837 31.9767 3.48837H18.0233Z" fill="#FFFF00" />
        </svg>
        ,
        title: 'Все что надо в одном месте',
        text: 'Все нужные сервисы и нейросети — в одном браузере. Работай быстро и удобно.',
    },
    {
        icon: <svg width="61" height="50" viewBox="0 0 61 50" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M60.9712 27.2738C61.0685 29.5805 60.2397 31.8313 58.6666 33.5324C57.0935 35.2335 54.9045 36.2461 52.58 36.3478C52.444 36.3541 52.3083 36.3572 52.1729 36.3572C51.5553 36.3568 50.9395 36.2905 50.3361 36.1594C48.5459 38.902 46.1985 41.2436 43.4441 43.0345C40.6897 44.8254 37.5888 46.0262 34.3399 46.56C33.9557 47.6801 33.189 48.6318 32.1726 49.2506C31.1561 49.8694 29.9537 50.1164 28.7732 49.9488C27.5927 49.7813 26.5082 49.2098 25.7074 48.333C24.9065 47.4563 24.4395 46.3295 24.3872 45.1473C24.3348 43.9652 24.7003 42.8021 25.4206 41.859C26.1408 40.9159 27.1705 40.2522 28.3316 39.9825C29.4928 39.7128 30.7124 39.8541 31.7796 40.382C32.8469 40.9099 33.6948 41.7912 34.1766 42.8736C38.7506 42.0342 42.8827 39.6289 45.8528 36.0768C48.8229 32.5247 50.4426 28.0511 50.4296 23.4357C50.4296 12.5318 41.4893 3.66087 30.5 3.66087C19.5107 3.66087 10.5704 12.5318 10.5704 23.4357C10.5698 26.8074 11.4382 30.1232 13.0932 33.0679C13.1493 33.1651 13.1914 33.2696 13.2183 33.3784C13.3781 33.8192 13.361 34.3042 13.1705 34.7329C12.98 35.1616 12.6307 35.5012 12.1949 35.6814C11.1277 36.1271 9.98151 36.3566 8.82366 36.3564C8.68739 36.3564 8.55084 36.3532 8.414 36.347C6.09043 36.2439 3.90288 35.2308 2.33101 33.5298C0.759127 31.8288 -0.0687839 29.5787 0.0288068 27.2729C0.0680388 26.3534 0.0461476 25.533 0.0247483 24.7397C0.00482486 23.9928 -0.0159594 23.2203 0.0182302 22.4143C0.120267 20.1629 1.0963 18.0381 2.74191 16.4847C4.38751 14.9314 6.57503 14.0701 8.84629 14.0813C12.4935 5.80139 20.8261 0 30.5 0C40.1739 0 48.5066 5.80139 52.1538 14.0814C54.4253 14.0686 56.6136 14.9291 58.2594 16.4825C59.9053 18.0358 60.881 20.1613 60.9817 22.413C61.016 23.2202 60.9953 23.9925 60.9751 24.7394C60.954 25.5329 60.932 26.3537 60.9712 27.2738ZM45.972 23.4357C45.9711 25.7876 45.4258 28.1079 44.3782 30.2176C43.3306 32.3274 41.8086 34.1702 39.9297 35.604C38.0507 37.0377 35.865 38.0242 33.541 38.4872C31.2171 38.9502 28.817 38.8774 26.5259 38.2744L20.2634 41.8629C19.9474 42.044 19.5844 42.128 19.2203 42.1044C18.8562 42.0807 18.5073 41.9504 18.2179 41.73C17.9284 41.5096 17.7112 41.209 17.594 40.8662C17.4767 40.5233 17.4645 40.1537 17.559 39.8039L19.1595 33.8797C16.509 31.037 15.0342 27.3084 15.0286 23.4357C15.0286 14.9683 21.9687 8.08028 30.5 8.08028C39.0313 8.08028 45.972 14.9683 45.972 23.4357ZM26.1986 23.4357C26.1986 22.9502 26.0043 22.4846 25.6583 22.1414C25.3123 21.7981 24.8431 21.6053 24.3539 21.6053H24.3508C23.9861 21.6059 23.6297 21.7139 23.3268 21.9154C23.0239 22.1169 22.788 22.403 22.6489 22.7376C22.5098 23.0721 22.4738 23.44 22.5453 23.7949C22.6169 24.1497 22.7929 24.4756 23.051 24.7312C23.3091 24.9869 23.6378 25.1608 23.9956 25.2312C24.3534 25.3016 24.7241 25.2651 25.061 25.1265C25.3979 24.9878 25.6858 24.7532 25.8883 24.4523C26.0909 24.1513 26.199 23.7976 26.199 23.4357H26.1986ZM32.3451 23.4357C32.345 23.3758 32.3417 23.3159 32.3353 23.2563C32.3295 23.1965 32.3205 23.137 32.3084 23.0781C32.2973 23.0195 32.2825 22.9616 32.264 22.9049C32.2469 22.8475 32.226 22.7914 32.2038 22.7352C32.1817 22.6791 32.1546 22.6266 32.1263 22.5742C32.0982 22.5214 32.0675 22.4701 32.0341 22.4204C32.0005 22.3702 31.9643 22.3218 31.9258 22.2752C31.8879 22.2285 31.8472 22.1841 31.8041 22.1422C31.7623 22.0995 31.7168 22.0592 31.6701 22.0202C31.6232 21.9835 31.574 21.9469 31.5236 21.914C31.4736 21.8809 31.4219 21.8503 31.3688 21.8225C31.3158 21.7944 31.2605 21.7688 31.2051 21.7456C31.1497 21.7226 31.0931 21.7026 31.0355 21.6858C30.9205 21.6491 30.8016 21.6254 30.6813 21.615C30.5006 21.5977 30.3184 21.6064 30.1402 21.6406C30.0808 21.6527 30.0222 21.6677 29.9644 21.6858C29.9068 21.7026 29.8501 21.7225 29.7947 21.7456C29.7393 21.7688 29.684 21.7944 29.6311 21.8225C29.5782 21.8505 29.5266 21.881 29.476 21.914C29.4255 21.9469 29.3764 21.9835 29.331 22.0202C29.2831 22.0592 29.2388 22.0995 29.1958 22.1422C29.1526 22.1842 29.1119 22.2286 29.0739 22.2752C29.0358 22.3218 29.0001 22.3702 28.967 22.4204C28.9332 22.47 28.902 22.5214 28.8735 22.5742C28.8452 22.6264 28.8197 22.6802 28.7972 22.7352C28.7738 22.7907 28.7533 22.8473 28.7357 22.9049C28.7186 22.961 28.7038 23.0196 28.6915 23.0781C28.6794 23.137 28.6703 23.1965 28.6643 23.2563C28.6583 23.3161 28.6557 23.3759 28.6557 23.4357C28.6557 23.4955 28.6583 23.5565 28.6643 23.6163C28.6704 23.6757 28.6795 23.7347 28.6915 23.7932C28.7038 23.8518 28.7186 23.9104 28.7357 23.9677C28.7533 24.0249 28.7738 24.0811 28.7972 24.1361C28.8197 24.1916 28.8452 24.2457 28.8735 24.2984C28.9017 24.3509 28.9338 24.4022 28.967 24.4522C29.0001 24.502 29.0358 24.55 29.0739 24.5962C29.1122 24.6429 29.1529 24.6877 29.1958 24.7304C29.2388 24.7719 29.2831 24.8134 29.331 24.8512C29.3773 24.8893 29.4257 24.9248 29.476 24.9574C29.5266 24.9903 29.5781 25.0221 29.6311 25.0501C29.7379 25.1054 29.8495 25.1511 29.9644 25.1868C30.0221 25.2039 30.0811 25.2185 30.1402 25.2307C30.2587 25.2548 30.3795 25.2667 30.5005 25.2661C30.9892 25.2648 31.4576 25.0723 31.8041 24.7304C31.8891 24.6448 31.9661 24.5517 32.0341 24.4522C32.0673 24.4022 32.0981 24.3509 32.1263 24.2984C32.1546 24.246 32.1805 24.191 32.2038 24.1361C32.2272 24.0812 32.2469 24.0239 32.264 23.9677C32.2824 23.9105 32.2972 23.8523 32.3084 23.7932C32.3204 23.7348 32.3294 23.6757 32.3353 23.6163C32.3416 23.5562 32.3447 23.4958 32.3448 23.4354L32.3451 23.4357ZM38.4943 23.4357C38.4943 22.9502 38.3 22.4846 37.954 22.1414C37.6081 21.7981 37.1388 21.6053 36.6496 21.6053H36.646C36.2813 21.606 35.925 21.7139 35.6221 21.9155C35.3192 22.117 35.0833 22.4031 34.9442 22.7377C34.8051 23.0722 34.7691 23.4401 34.8407 23.795C34.9123 24.1498 35.0883 24.4756 35.3464 24.7312C35.6045 24.9869 35.9332 25.1609 36.291 25.2312C36.6488 25.3015 37.0195 25.2651 37.3564 25.1265C37.6932 24.9878 37.9811 24.7532 38.1837 24.4523C38.3862 24.1513 38.4943 23.7976 38.4943 23.4357Z" fill="#FFFF00" />
        </svg>
        ,
        title: 'Поддержка 24/7',
        text: 'Мы на связи 24/7 — отвечаем быстро и помогаем решать любые вопросы без лишнего ожидания.',
    },
]


export const cards3 = [
    {
        width: "59px",
        img: "/assets/AI/adHeart.png",
        background: "#FFC300",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "AdHeart",
        title: "Spy-сервис",
        info: "Adheart — это сервис для анализа рекламы в Facebook и Instagram. Он предоставляет большую базу креативов, помогает находить идеи, изучать рекламу конкурентов и запускать эффективные объявления быстрее.",
        onclick: console.log("")
    },
    {
        width: "80px",
        img: "/assets/AI/chatGpt.png",
        background: "#222222",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "ChatGPT",
        title: "Нейросеть",
        info: "ChatGPT — это искусственный интеллект для общения и работы. Он способен понимать и генерировать текст, отвечать на вопросы, помогать с задачами, писать тексты и вести разговоры на различные темы.",
        onclick: console.log("")
    },
    {
        width: "62px",
        img: "/assets/AI/envato.png",
        background: "#87E64B",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Envato Elements",
        title: "Огромный сток материалов",
        info: "Envato — это платформа, которая предоставляет доступ к шаблонам, графике, видео, музыке и другим креативным элементам для дизайнеров, разработчиков и контент-мейкеров, помогая ускорить процесс создания и улучшить качество проектов.",
        onclick: console.log("")
    },
    {
        width: "75px",
        img: "/assets/AI/midjourney.png",
        background: "#FFFFFF",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Midjourney",
        title: "Нейросеть",
        info: "Midjourney — это искусственный интеллект для генерации изображений по текстовым описаниям. Он позволяет создавать уникальные визуальные работы, превращая идеи в изображения с помощью простых текстовых команд.",
        onclick: console.log("")
    },
    {
        width: "64px",
        img: "/assets/AI/claude.png",
        background: "#F3E9D7",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Claude AI",
        title: "Нейросеть",
        info: "Claude AI — это искусственный интеллект, разработанный для обработки текста и общения. Он помогает решать задачи, отвечает на вопросы и генерирует текст на основе запросов, обеспечивая эффективную поддержку в различных сферах.",
        onclick: console.log("")
    },
    {
        width: "57px",
        img: "/assets/AI/freepik.png",
        background: "#2163C7",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Freepik",
        title: "Фотосток",
        info: "Freepik — это платформа для поиска и скачивания графики, векторных изображений, иконок и шаблонов. Она предоставляет инструменты для дизайнеров, маркетологов и контент-мейкеров, ускоряя процесс создания визуального контента.",
        onclick: console.log("")
    },
    {
        img: "/assets/AI/canva.png",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Canva",
        title: "Редактор",
        info: "Canva — онлайн-платформа для создания и редактирования графики, которая предлагает широкий выбор шаблонов, фотографий, иконок и шрифтов. Она идеально подходит для дизайнеров, маркетологов и всех, кто работает с визуальным контентом.",
        onclick: console.log("")
    },
    {
        width: "73px",
        img: "/assets/AI/capcut.png",
        background: "#FFFFFF",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Cap Cut",
        title: "Видеоредактор",
        info: "CapCut — это видеоредактор, который предлагает широкий набор инструментов для создания и редактирования видео. Он позволяет добавлять эффекты, музыку, текст и переходы, идеально подходя для пользователей, создающих контент на мобильных устройствах.",
        onclick: console.log("")
    }
]


export const cards4 = [
    {
        name: "Гарий",
        image: "/assets/userImg1.png",
        message: "Взял Midjourney , все работает. Картинки генерит без задержек. Спасибо!"
    },
    {
        name: "Виталий",
        image: "/assets/userImg2.png",
        message: "Брал для команды Tgstat. Все четко. Будем дальше сотрудничать. Никаких ограничений и проблем за месяц использования не заметил"
    },
    {
        name: "Виталий",
        image: "/assets/userImg2.png",
        message: "Брал для команды Tgstat. Все четко. Будем дальше сотрудничать. Никаких ограничений и проблем за месяц использования не заметил"
    },
    {
        name: "Виталий",
        image: "/assets/userImg2.png",
        message: "Брал для команды Tgstat. Все четко. Будем дальше сотрудничать. Никаких ограничений и проблем за месяц использования не заметил"
    },
    {
        name: "Виталий",
        image: "/assets/userImg2.png",
        message: "Брал для команды Tgstat. Все четко. Будем дальше сотрудничать. Никаких ограничений и проблем за месяц использования не заметил"
    },
    {
        name: "Виталий",
        image: "/assets/userImg2.png",
        message: "Брал для команды Tgstat. Все четко. Будем дальше сотрудничать. Никаких ограничений и проблем за месяц использования не заметил"
    },
    {
        name: "Виталий",
        image: "/assets/userImg2.png",
        message: "Брал для команды Tgstat. Все четко. Будем дальше сотрудничать. Никаких ограничений и проблем за месяц использования не заметил"
    },
    {
        name: "Виталий",
        image: "/assets/userImg2.png",
        message: "Брал для команды Tgstat. Все четко. Будем дальше сотрудничать. Никаких ограничений и проблем за месяц использования не заметил"
    },
    {
        name: "Виталий",
        image: "/assets/userImg2.png",
        message: "Брал для команды Tgstat. Все четко. Будем дальше сотрудничать. Никаких ограничений и проблем за месяц использования не заметил"
    },
]

export const cards5 = [
    {
        width: "80px",
        img: "/assets/AI/chatGpt.png",
        background: "#222222",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "ChatGPT",
        title: "Нейросеть",
        info: "ChatGPT — это искусственный интеллект для общения и работы. Он способен понимать и генерировать текст, отвечать на вопросы, помогать с задачами, писать тексты и вести разговоры на различные темы.",
        onclick: console.log("")
    },
    {
        width: "75px",
        img: "/assets/AI/midjourney.png",
        background: "#FFFFFF",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Midjourney",
        title: "Нейросеть",
        info: "Midjourney — это искусственный интеллект для генерации изображений по текстовым описаниям. Он позволяет создавать уникальные визуальные работы, превращая идеи в изображения с помощью простых текстовых команд.",
        onclick: console.log("")
    },
    {
        width: "57px",
        img: "/assets/AI/freepik.png",
        background: "#2163C7",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Freepik",
        title: "Фотосток",
        info: "Freepik — это платформа для поиска и скачивания графики, векторных изображений, иконок и шаблонов. Она предоставляет инструменты для дизайнеров, маркетологов и контент-мейкеров, ускоряя процесс создания визуального контента.",
        onclick: console.log("")
    },
    {
        width: "62px",
        img: "/assets/AI/envato.png",
        background: "#87E64B",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Envato Elements",
        title: "Огромный сток материалов",
        info: "Envato — это платформа, которая предоставляет доступ к шаблонам, графике, видео, музыке и другим креативным элементам для дизайнеров, разработчиков и контент-мейкеров, помогая ускорить процесс создания и улучшить качество проектов.",
        onclick: console.log("")
    },
    {
        width: "59px",
        img: "/assets/AI/adHeart.png",
        background: "#FFC300",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "AdHeart",
        title: "Spy-сервис",
        info: "Adheart — это сервис для анализа рекламы в Facebook и Instagram. Он предоставляет большую базу креативов, помогает находить идеи, изучать рекламу конкурентов и запускать эффективные объявления быстрее.",
        onclick: console.log("")
    },
    {
        width: "64px",
        img: "/assets/AI/claude.png",
        background: "#F3E9D7",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Claude AI",
        title: "Нейросеть",
        info: "Claude AI — это искусственный интеллект, разработанный для обработки текста и общения. Он помогает решать задачи, отвечает на вопросы и генерирует текст на основе запросов, обеспечивая эффективную поддержку в различных сферах.",
        onclick: console.log("")
    },
    {
        img: "/assets/AI/canva.png",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Canva",
        title: "Редактор",
        info: "Canva — онлайн-платформа для создания и редактирования графики, которая предлагает широкий выбор шаблонов, фотографий, иконок и шрифтов. Она идеально подходит для дизайнеров, маркетологов и всех, кто работает с визуальным контентом.",
        onclick: console.log("")
    },
    {
        width: "73px",
        img: "/assets/AI/capcut.png",
        background: "#FFFFFF",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Cap Cut Pro",
        title: "Видеоредактор",
        info: "CapCut — это видеоредактор, который предлагает широкий набор инструментов для создания и редактирования видео. Он позволяет добавлять эффекты, музыку, текст и переходы, идеально подходя для пользователей, создающих контент на мобильных устройствах.",
        onclick: console.log("")
    },
    {
        width: "61px",
        img: "/assets/AI/leonardo.png",
        background: "#FFFFFF",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Leonardo AI",
        title: "Нейросеть",
        info: "Leonardo AI — это мощный искусственный интеллект для создания изображений. Он помогает генерировать графику по описанию, подходит для дизайнеров, художников и креативных проектов, а также легко адаптируется под разные стили и задачи.",
        onclick: console.log("")
    },
    {
        width: "73px",
        img: "/assets/AI/segmento.png",
        background: "#FFFFFF",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Segmento Target",
        title: "Редактор",
        info: "Segmento Target — это сервис для сбора и анализа аудитории из различных социальных сетей. Он позволяет находить целевые группы, активных участников, подписчиков сообществ и друзей пользователей, формируя базы данных для последующего ретаргетинга и более точной настройки рекламных кампаний.",
        onclick: console.log("")
    },
    {
        width: "89px",
        img: "/assets/AI/tgStat.png",
        background: "#303644",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "TGstat",
        title: "Телеграм-аналитика",
        info: "TGStat — это мощный инструмент аналитики Telegram. Он позволяет отслеживать статистику каналов, анализировать рост аудитории, активность подписчиков и эффективность публикаций. Подходит для маркетологов, владельцев каналов и SMM-специалистов.",
        onclick: console.log("")
    },
    {
        width: "80px",
        img: "/assets/AI/supa.png",
        background: "#FFFFFF",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Supa",
        title: "Видеоредактор",
        info: "Supa.ru — это онлайн-сервис для быстрого создания видео. Подходит для маркетологов, блогеров и SMM-специалистов. Помогает легко делать ролики для соцсетей, рекламы и презентаций без навыков монтажа.",
        onclick: console.log("")
    },
    {
        width: "90px",
        img: "/assets/AI/semrush.png",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Semrush",
        title: "SEO и PPC",
        info: "Semrush — это многофункциональный сервис для анализа сайтов и продвижения в поиске. Подходит SEO-специалистам, маркетологам и владельцам бизнеса. Помогает находить ключевые слова, отслеживать конкурентов и улучшать позиции в поисковых системах.",
        onclick: console.log("")
    },
    {
        width: "60px",
        img: "/assets/AI/serpstat.png",
        background: "#FFFFFF",
        discount: "-70%",
        salePrice: "699₽",
        oldPrice: "7000₽",
        name: "Serpstat",
        title: "SEO и PPC",
        info: "Serpstat — это универсальная платформа для SEO и маркетинга. Подходит специалистам по продвижению, контент-маркетологам и аналитикам.С её помощью можно подбирать ключевые слова, анализировать конкурентов, отслеживать позиции сайта",
        onclick: console.log("")
    },
]