// app/page.js
"use client";
import Flags from './components/flags';
import styles from './page.module.css';
import { cards1, cards2, cards3, cards4 } from './data/cards';
import Card from './components/card/Card';
import Accordion from './components/accordion/Accordion';
import { ReviewsSection } from './components/carouselCard';
import { useState } from 'react';
import Link from 'next/link';

export default function HomePage() {
  const [openModal, setOPenModal] = useState(false)

  return (
    <div className={`home ${styles.home}`}>
      <header className={styles.header}>
        <div className={`${styles.container} container`}>
          <div className={styles.main}>
            <div className={styles.mainTitle}>
              <h3>Abbsnet - лучший поставщик доступов в СНГ</h3>
              <div className={styles.flags}>
                <Flags />
              </div>
            </div>
            <h1>
              Быстрый, безопасный и <span className={styles.highlight}>недорогой</span> доступ к сервисам и нейросетям
            </h1>
            <p>
              Самый большой и популярный сервис, где любой может купить доступ к нужному сервису или нейросети из нашего наличия и использовать его с большой выгодой
            </p>
            <div className={styles.features}>
              <div className={styles.featuresBlock}>
                <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M7.5 0C6.01664 0 4.56659 0.439867 3.33323 1.26398C2.09986 2.08809 1.13856 3.25943 0.570907 4.62987C0.00324963 6.00032 -0.145275 7.50832 0.144114 8.96318C0.433503 10.418 1.14781 11.7544 2.1967 12.8033C3.2456 13.8522 4.58197 14.5665 6.03682 14.8559C7.49168 15.1453 8.99968 14.9968 10.3701 14.4291C11.7406 13.8614 12.9119 12.9001 13.736 11.6668C14.5601 10.4334 15 8.98336 15 7.5C14.9962 5.51205 14.2048 3.60661 12.7991 2.20091C11.3934 0.795212 9.48795 0.003812 7.5 0ZM8.36539 10.9615H8.07692V11.5385C8.07692 11.6915 8.01614 11.8382 7.90795 11.9464C7.79975 12.0546 7.65301 12.1154 7.5 12.1154C7.34699 12.1154 7.20025 12.0546 7.09206 11.9464C6.98386 11.8382 6.92308 11.6915 6.92308 11.5385V10.9615H5.76923C5.61622 10.9615 5.46948 10.9008 5.36129 10.7926C5.25309 10.6844 5.19231 10.5376 5.19231 10.3846C5.19231 10.2316 5.25309 10.0849 5.36129 9.97667C5.46948 9.86847 5.61622 9.80769 5.76923 9.80769H8.36539C8.5949 9.80769 8.81501 9.71652 8.9773 9.55422C9.1396 9.39193 9.23077 9.17182 9.23077 8.94231C9.23077 8.71279 9.1396 8.49268 8.9773 8.33039C8.81501 8.1681 8.5949 8.07692 8.36539 8.07692H6.63462C6.09908 8.07692 5.58548 7.86418 5.20681 7.4855C4.82813 7.10682 4.61539 6.59322 4.61539 6.05769C4.61539 5.52216 4.82813 5.00856 5.20681 4.62988C5.58548 4.2512 6.09908 4.03846 6.63462 4.03846H6.92308V3.46154C6.92308 3.30853 6.98386 3.16179 7.09206 3.05359C7.20025 2.9454 7.34699 2.88461 7.5 2.88461C7.65301 2.88461 7.79975 2.9454 7.90795 3.05359C8.01614 3.16179 8.07692 3.30853 8.07692 3.46154V4.03846H9.23077C9.38378 4.03846 9.53052 4.09924 9.63872 4.20744C9.74691 4.31563 9.80769 4.46237 9.80769 4.61538C9.80769 4.76839 9.74691 4.91514 9.63872 5.02333C9.53052 5.13152 9.38378 5.19231 9.23077 5.19231H6.63462C6.4051 5.19231 6.18499 5.28348 6.0227 5.44577C5.86041 5.60806 5.76923 5.82818 5.76923 6.05769C5.76923 6.2872 5.86041 6.50732 6.0227 6.66961C6.18499 6.8319 6.4051 6.92308 6.63462 6.92308H8.36539C8.90092 6.92308 9.41452 7.13581 9.7932 7.51449C10.1719 7.89317 10.3846 8.40677 10.3846 8.94231C10.3846 9.47784 10.1719 9.99144 9.7932 10.3701C9.41452 10.7488 8.90092 10.9615 8.36539 10.9615Z" fill="#FFFF00" />
                </svg>
                <h4>Самые низкие цены</h4>
              </div>
              <div className={styles.featuresBlock}>
                <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M15 1.25V9.375C15 9.70652 14.8683 10.0245 14.6339 10.2589C14.3995 10.4933 14.0815 10.625 13.75 10.625H6.25V11.875C6.25039 11.9984 6.21424 12.1191 6.14612 12.222C6.07799 12.3249 5.98094 12.4053 5.86719 12.4531C5.79009 12.4837 5.70795 12.4996 5.625 12.5C5.45904 12.4993 5.29966 12.435 5.17969 12.3203L3.30469 10.4453C3.18732 10.3268 3.12148 10.1668 3.12148 10C3.12148 9.83322 3.18732 9.67318 3.30469 9.55469L5.17969 7.67969C5.27005 7.5949 5.38258 7.53743 5.50424 7.51393C5.62591 7.49042 5.75174 7.50185 5.86719 7.54688C5.98094 7.59469 6.07799 7.6751 6.14612 7.77798C6.21424 7.88087 6.25039 8.00161 6.25 8.125V9.375H13.75V1.25H5V1.875C5 2.04076 4.93415 2.19973 4.81694 2.31694C4.69973 2.43415 4.54076 2.5 4.375 2.5C4.20924 2.5 4.05027 2.43415 3.93306 2.31694C3.81585 2.19973 3.75 2.04076 3.75 1.875V1.25C3.75 0.918479 3.8817 0.600537 4.11612 0.366116C4.35054 0.131696 4.66848 0 5 0H13.75C14.0815 0 14.3995 0.131696 14.6339 0.366116C14.8683 0.600537 15 0.918479 15 1.25ZM10.625 12.5C10.4592 12.5 10.3003 12.5658 10.1831 12.6831C10.0658 12.8003 10 12.9592 10 13.125V13.75H1.25V5.625H8.75V6.875C8.75063 6.99816 8.78718 7.11847 8.85518 7.22116C8.92318 7.32385 9.01966 7.40447 9.13281 7.45312C9.20991 7.48374 9.29205 7.49964 9.375 7.5C9.54096 7.4993 9.70034 7.43499 9.82031 7.32031L11.6953 5.44531C11.8127 5.32682 11.8785 5.16678 11.8785 5C11.8785 4.83322 11.8127 4.67318 11.6953 4.55469L9.82031 2.67969C9.73097 2.59322 9.61839 2.53462 9.49631 2.51104C9.37424 2.48746 9.24793 2.49991 9.13281 2.54688C9.01906 2.59469 8.92201 2.6751 8.85388 2.77798C8.78576 2.88087 8.74961 3.00161 8.75 3.125V4.375H1.25C0.918479 4.375 0.600537 4.5067 0.366116 4.74112C0.131696 4.97554 0 5.29348 0 5.625V13.75C0 14.0815 0.131696 14.3995 0.366116 14.6339C0.600537 14.8683 0.918479 15 1.25 15H10C10.3315 15 10.6495 14.8683 10.8839 14.6339C11.1183 14.3995 11.25 14.0815 11.25 13.75V13.125C11.25 12.9592 11.1842 12.8003 11.0669 12.6831C10.9497 12.5658 10.7908 12.5 10.625 12.5Z" fill="#FFFF00" />
                </svg>
                <h4>Замена в случае блокировки</h4></div>
              <div className={styles.featuresBlock}>
                <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M15.3224 11.8387C15.7615 11.0192 15.994 10.1049 15.9999 9.17511C16.0058 8.24536 15.7848 7.32821 15.356 6.50318C14.9273 5.67814 14.3039 4.97013 13.5397 4.44052C12.7755 3.9109 11.8937 3.57568 10.9706 3.46391C10.6667 2.75508 10.2225 2.11507 9.66476 1.58242C9.10701 1.04976 8.44725 0.635474 7.72518 0.364491C7.00312 0.0935085 6.23369 -0.0285653 5.46321 0.00561826C4.69274 0.0398018 3.93714 0.229536 3.24191 0.563399C2.54669 0.897263 1.92621 1.36835 1.41782 1.94831C0.909433 2.52826 0.523655 3.20509 0.283709 3.93805C0.0437631 4.67101 -0.0453897 5.44495 0.0216176 6.21327C0.088625 6.98159 0.310407 7.7284 0.673612 8.40876L0.230577 9.95224C0.179228 10.1239 0.175286 10.3063 0.219171 10.4801C0.263055 10.6538 0.353129 10.8125 0.479848 10.9392C0.606566 11.0659 0.765208 11.156 0.938959 11.1999C1.11271 11.2437 1.2951 11.2398 1.46679 11.1885L3.01027 10.7454C3.63713 11.0796 4.32026 11.2952 5.02537 11.3814C5.33682 12.1113 5.79683 12.7684 6.37612 13.3108C6.95541 13.8532 7.64129 14.269 8.39009 14.5319C9.1389 14.7947 9.93422 14.8987 10.7254 14.8373C11.5166 14.776 12.2864 14.5505 12.9857 14.1754L14.5292 14.6184C14.7009 14.6698 14.8833 14.6737 15.057 14.6298C15.2308 14.5859 15.3894 14.4959 15.5161 14.3691C15.6429 14.2424 15.7329 14.0838 15.7768 13.91C15.8207 13.7363 15.8168 13.5539 15.7654 13.3822L15.3224 11.8387ZM14.2219 11.4743C14.1803 11.5393 14.1531 11.6125 14.142 11.6889C14.1309 11.7653 14.1362 11.8431 14.1576 11.9173L14.6007 13.4537L13.0643 13.0106C12.9901 12.9892 12.9123 12.9839 12.8359 12.995C12.7595 13.0061 12.6863 13.0333 12.6213 13.0749C12.0974 13.384 11.5174 13.5858 10.9148 13.6687C10.3122 13.7515 9.69921 13.7137 9.1114 13.5574C8.52358 13.4012 7.9727 13.1296 7.49082 12.7585C7.00893 12.3873 6.60566 11.9241 6.30445 11.3957C7.70943 11.2459 9.00957 10.5824 9.95521 9.5326C10.9009 8.48277 11.4253 7.1206 11.4279 5.70767C11.4263 5.36502 11.3953 5.02315 11.3351 4.68583C12.3379 4.9225 13.2315 5.49091 13.8709 6.29893C14.5103 7.10695 14.8581 8.10722 14.8579 9.13763C14.8569 9.95914 14.6374 10.7656 14.2219 11.4743Z" fill="#FFFF00" />
                </svg>
                <h4>Поддержка 24/7</h4></div>
              <div className={styles.featuresBlock}>
                <svg width="16" height="14" viewBox="0 0 16 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M14.7692 0H1.23078C0.904359 0 0.591308 0.12967 0.360494 0.360483C0.129681 0.591297 1.08204e-05 0.904348 1.08204e-05 1.23077V12.9231C-0.000615784 13.0281 0.0259823 13.1315 0.0772112 13.2231C0.12844 13.3148 0.202551 13.3916 0.292318 13.4461C0.381363 13.5021 0.483269 13.5343 0.588308 13.5397C0.693347 13.5451 0.798013 13.5235 0.892317 13.4769L3.07693 12.3769L5.26154 13.4769C5.34793 13.5185 5.44258 13.5401 5.53847 13.5401C5.63435 13.5401 5.729 13.5185 5.81539 13.4769L8 12.3769L10.1846 13.4769C10.2713 13.5174 10.3658 13.5384 10.4615 13.5384C10.5572 13.5384 10.6518 13.5174 10.7385 13.4769L12.9231 12.3769L15.1077 13.4769C15.202 13.5235 15.3067 13.5451 15.4117 13.5397C15.5167 13.5343 15.6186 13.5021 15.7077 13.4461C15.7974 13.3916 15.8716 13.3148 15.9228 13.2231C15.974 13.1315 16.0006 13.0281 16 12.9231V1.23077C16 0.904348 15.8703 0.591297 15.6395 0.360483C15.4087 0.12967 15.0956 0 14.7692 0ZM12 7.99999H4.00001C3.8368 7.99999 3.68027 7.93515 3.56486 7.81975C3.44946 7.70434 3.38462 7.54782 3.38462 7.38461C3.38462 7.2214 3.44946 7.06487 3.56486 6.94946C3.68027 6.83406 3.8368 6.76922 4.00001 6.76922H12C12.1632 6.76922 12.3197 6.83406 12.4351 6.94946C12.5505 7.06487 12.6154 7.2214 12.6154 7.38461C12.6154 7.54782 12.5505 7.70434 12.4351 7.81975C12.3197 7.93515 12.1632 7.99999 12 7.99999ZM12 5.53845H4.00001C3.8368 5.53845 3.68027 5.47362 3.56486 5.35821C3.44946 5.24281 3.38462 5.08628 3.38462 4.92307C3.38462 4.75986 3.44946 4.60334 3.56486 4.48793C3.68027 4.37252 3.8368 4.30769 4.00001 4.30769H12C12.1632 4.30769 12.3197 4.37252 12.4351 4.48793C12.5505 4.60334 12.6154 4.75986 12.6154 4.92307C12.6154 5.08628 12.5505 5.24281 12.4351 5.35821C12.3197 5.47362 12.1632 5.53845 12 5.53845Z" fill="#FFFF00" />
                </svg>
                <h4>Большой ассортимент</h4></div>
            </div>
            <div className={styles.buttonItem}>
              <Link href={'/services'}><button>Посмотреть ассортимент</button></Link>
            </div>
            <div className={styles.notice}>
              <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M13.8755 4.6875H8.46612L10.463 0.884766C10.6505 0.439453 10.1114 0 9.3755 0H2.6255C2.063 0 1.58487 0.260742 1.50987 0.609375L0.00987083 7.64062C-0.0791917 8.0625 0.445808 8.4375 1.1255 8.4375H6.68956L4.52862 14.1357C4.35987 14.5811 4.90362 15 5.62081 15C6.01456 15 6.38956 14.8711 6.59581 14.6484L14.8458 5.74219C15.2817 5.27637 14.7427 4.6875 13.8755 4.6875Z" fill="#FFFF00" />
              </svg>
              <span className={styles.highlight}>Больше</span> <span className={styles.highlight}>20</span> <span>сервисов</span> <span>и</span> <span>нейросетей</span> <span className={styles.highlight}>в</span> <span className={styles.highlight}>наличии</span></div>
          </div>
        </div>

        <section className={styles.videoIntro}>
          <div className={styles.left_block}>
            <p>Полный обзор нашего сервиса</p>
            <svg width="119" height="90" viewBox="0 0 119 90" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M62.3368 18.3416C64.2366 20.3646 66.815 22.5224 68.5791 25.0849C72.2431 30.4795 75.6357 36.0089 79.0283 41.5384C85.4063 52.0579 91.7844 62.7122 98.7053 74.1757C89.7488 71.2087 83.0994 63.6562 72.5145 65.4095C73.4645 67.0279 73.7359 68.3765 74.4144 68.6462C84.9992 72.9619 94.2271 79.4354 102.912 86.5833C110.104 92.3825 113.768 90.7641 114.718 81.9979C115.668 72.8271 117.568 63.6562 118.925 54.4854C119.196 53.0019 118.654 51.3835 118.518 49.4954C112.683 52.1927 112.683 52.1927 107.797 72.2876C106.712 70.5344 105.762 69.1857 104.948 67.8371C96.9411 53.946 89.0703 40.0549 80.7924 26.2987C78.0784 21.8481 74.8215 17.6673 71.1575 14.026C64.6437 7.55244 57.4515 7.82217 51.3448 14.7003C48.2236 18.2068 45.9167 22.5224 43.8811 26.8381C41.5742 31.6933 40.0814 36.953 38.0459 41.943C36.5531 45.4495 34.6533 48.8211 32.8891 52.4625C28.6823 50.8441 27.0539 47.7422 25.1541 44.91C17.1476 32.907 11.1766 20.0949 6.69842 6.33866C6.15561 4.72028 5.8842 2.96703 4.93427 1.48351C4.39146 0.674324 2.89872 0 1.81309 0C1.27028 0 0.184647 1.48352 0.0489437 2.29271C-0.0867596 4.58541 0.0489561 7.14785 0.591769 9.30569C4.39146 24.8152 10.7695 39.2457 19.8616 52.3276C21.6258 55.0249 23.9327 57.4525 26.3754 59.4754C30.8536 63.1168 35.3318 62.9819 38.9958 58.5314C41.9813 54.89 44.1525 50.5743 46.0524 46.2587C48.9022 39.92 50.9377 33.3116 53.7875 26.973C55.4159 23.6014 57.3158 20.0949 62.3368 18.3416Z" fill="white" />
            </svg>
          </div>
          <div className={styles.videoWrapper} onClick={() => setOPenModal(true)}>
            <img src="/assets/videoImg.jpg" alt="" />
            <div className={styles.playButton}>
              <div className={styles.playButtonItem}>
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 384 512" fill="white">
                  <path d="M73 39c-14.8-9.1-33.4-9.4-48.5-.9S0 62.6 0 80L0 432c0 17.4 9.4 33.4 24.5 41.9s33.7 8.1 48.5-.9L361 297c14.3-8.7 23-24.2 23-41s-8.7-32.2-23-41L73 39z" />
                </svg>
              </div>
            </div>
            <div className={styles.videoWrapperBg}></div>
          </div>
          <div className={styles.right_block}>
            <p>Всего 12 минут и ты полностью <br /> поймёшь, как работает AbbsNet</p>
            <svg width="113" height="47" viewBox="0 0 113 47" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M103.228 29.402C100.817 31.7108 98.6203 33.6611 96.5537 35.64C89.2478 42.2796 80.7979 46.0973 70.7708 46.5918C63.5057 46.8837 57.1979 44.6816 52.5649 39.197C47.9319 33.7124 43.6717 27.769 39.3547 22.0835C37.1456 19.162 35.2241 16.1687 32.9866 13.3762C28.8876 8.55031 25.3893 7.7791 19.3662 9.83253C12.1644 12.3024 6.75459 17.737 3.26625 26.1649C-0.608147 24.6346 -0.18488 21.4819 1.06008 18.9161C2.57677 15.734 4.51063 12.5086 6.95012 10.0709C9.73404 7.30334 13.1374 4.80762 16.6292 3.14292C25.4521 -1.13355 32.6067 0.308456 39 7.66887C42.7955 12.0221 45.8011 16.8774 49.2806 21.4315C52.4283 25.6419 55.7056 29.8809 59.1409 34.0195C61.7102 37.1556 65.2244 38.4713 69.2535 38.6833C75.4411 38.9654 80.9617 37.3422 86.2042 33.8994C87.3102 33.1965 88.2866 32.465 89.2915 31.6045C93.627 27.9618 97.9625 24.3191 102.642 20.3466C93.8952 20.5822 85.8243 20.8317 77.6238 21.0526C77.4942 21.024 77.2476 20.2934 76.9727 19.6918C77.6047 19.2902 78.1924 18.473 78.7676 18.3293C86.791 16.4463 94.8714 14.3054 103.012 13.1245C109.326 12.2172 112.426 14.7941 112.673 21.07C112.961 26.5435 112.155 32.0464 111.248 37.3917C111.094 38.7101 108.825 40.3739 107.415 40.6042C106.553 40.8198 104.562 38.7579 104.17 37.4542C103.329 35.1049 103.481 32.5686 103.228 29.402Z" fill="white" />
            </svg>
          </div>
          {
            openModal && (
              <div
                className={styles.modal}
                onClick={() => setOPenModal(false)}
              >
                <div className={`${styles.modalItem} ${!openModal ? styles.modalHide : styles.modalShow}`}>
                  <div className={styles.closeButton}>X</div>
                  <iframe width="100%" height="100%" src="https://www.youtube.com/embed/qBupou26ZMw?si=Som53yBjAKb79J7a" title="YouTube video player" frameBorder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
                </div>
              </div>
            )
          }
        </section>
      </header>


      <div className={`${styles.container} container`}>
        <section className={styles.howItWorks}>
          <div className={styles.mainTitle}>
            <h3>Abbsnet</h3>
          </div>
          <div className={styles.title}>Как это работает?</div>
          <div className={styles.subTitle}>Не нужно быть гением, чтобы начать экономить, всё очень просто и понятно!</div>
          <div className={styles.cardsWrapper}>
            {cards1.map((card, index) => (
              <Card key={index} type="howItWorks" data={card} />
            ))}
          </div>
        </section>

        <section className={styles.benefitsSection}>
          <div className={styles.mainTitle}>
            <h3>думаешь</h3>
          </div>
          <div className={styles.title}>Стоит ли покупать именно у нас?</div>
          <div className={styles.subTitle}>Конечно стоит! Ибо мы на голову выше наших конкурентов, и подобных сервисов</div>
          <div className={styles.cardsWrapper}>
            {cards2.map((card, index) => (
              <Card key={index} type="benefits" data={card} />
            ))}
          </div>
        </section>


        <section className={styles.services}>
          <div className={styles.mainTitle}>
            <h3>широкий ассортимент</h3>
          </div>
          <div className={styles.title}>Ты точно найдешь сервис, который искал</div>
          <div className={styles.subTitle}>20+ сервисов и нейросетей для любых задач — от дизайна и маркетинга до повседневных нужд. Каждый найдёт что-то полезное для себя</div>
          <div className={styles.cardsWrapper}>
            {cards3.map((card, index) => (
              <Card key={index} type="services" data={card} />
            ))}
          </div>
          <div className={styles.buttonItem}>
            <Link href={'/services'}>
              <button>Посмотреть весь ассортимент</button>
            </Link>
          </div>
        </section>


        <ReviewsSection cards4={cards4} />

        <section className={styles.faq}>
          <div className={styles.mainTitle}>
            <h3>FAQ</h3>
          </div>
          <div className={styles.title}>Вопросы и ответы</div>
          <div className={styles.subTitle}>Остались вопросы? Напишите нам в Telegram — мы ответим в течение нескольких минут.</div>
          <a href="https://t.me/m/jidwlHXNNDFi" target='_blank' className={`${styles.tg_link} click`}>Написать в Telegram</a>
          <Accordion />
          <div className={styles.buttonItem}>
            <Link href={'https://t.me/m/EAB5DZONZDky'}>
              <button>Приобрести доступ</button>
            </Link>
          </div>
        </section>

        <section className={styles.startSaving}>
          <div className={styles.mainTitle}>
            <h3>НАЧИНАЙ ЭКОНОМИТЬ</h3>
          </div>
          <div className={styles.title}>Присоединяйся к AbbsNet</div>
          <div className={styles.subTitle}>Благодаря нашему сервису вы можете экономить десятки тысяч рублей каждый  месяц, не теряя в качестве используемых продуктов. Представьте, сколько  можно сэкономить, пользуясь нашими услугами в течение целого года!</div>
          <div className={styles.main}>
            <h1>
              <span className={styles.highlight}>2000₽+</span> Экономии в месяц
            </h1>
          </div>
          <div className={styles.buttonItem}>
            <Link href={'https://t.me/m/EAB5DZONZDky'}>
              <button>Приобрести доступ</button>
            </Link>
          </div>
        </section>
      </div>
    </div>
  );
}
